// 2. Поменять местами первую и вторую половину 
// массива, например, для массива 1 2 3 4, 
// результат 3 4 1 2. Если в массиве кол-во элементов 
// нечётное (1 2 3 4 5),  “средний” элемент оставить 
// на своём месте: 4 5 3 1 2


// arr[0] <=> arr[2]
// arr[1] <=> arr[3]

let arr11 = [1, 2, 3, 4,5,6], b11, c11, d11;

console.log(arr11);
console.log('=====================');

c11 = arr11.length / 2;

for (let i = 0; i <= c11 - 1; i++) {
    b11 = i + c11;
    d11 = arr11[i];
    arr11[i] = arr11[b11];
    arr11[b11] = d11;

    console.log(arr11);
    console.log(i);
}
// ======================================






let a1 = [1, 2, 3, 4], b1;

console.log(a1);

b1 = [a1[0],a1[1]];

[a1[0], a1[1]] = [a1[2], a1[3]];

[a1[2], a1[3]] = b1;

console.log(a1);
console.log('//===========================>')
console.log('Второй вариант:')

let aa1 = [1, 2, 3, 4, 5], bb1;
bb1 = aa1[0];
aa1[0] = aa1[3];
aa1[3] = bb1;
bb1 = aa1[1];
aa1[1] = aa1[4];
aa1[4] = bb1;

console.log(aa1)
console.log('//===========================>')