// 2. Поменять местами первую и вторую половину 
// массива, например, для массива 1 2 3 4, 
// результат 3 4 1 2. Если в массиве кол-во элементов 
// нечётное (1 2 3 4 5),  “средний” элемент оставить 
// на своём месте: 4 5 3 1 2


let a1 = [1, 2, 3, 4], b1;

console.log(a1);

b1 = [a1[0],a1[1]];

[a1[0], a1[1]] = [a1[2], a1[3]];

[a1[2], a1[3]] = b1;

console.log(a1);
console.log('//===========================>')
console.log('Второй вариант:')

let aa1 = [1, 2, 3, 4, 5], bb1;
bb1 = aa1[0];
aa1[0] = aa1[3];
aa1[3] = bb1;
bb1 = aa1[1];
aa1[1] = aa1[4];
aa1[4] = bb1;

console.log(aa1)
console.log('//===========================>')